package src.views;

public enum Templates {
        /** Шаблон страницы */
        PAGE_EMPTY(
                        """
                        =============================================================
                        |                                                           |
                        |   TOY-AMAZ(o)N.COM                                        |
                        |                                                           |
                        =============================================================
                        |                                                           |
                        |   You are Welcome!                                        |
                        |  %20s                                     |
                        |                                                           |
                        =============================================================
                        |                                                           |
                        |    YOUR CART IS EMPTY
                        |                                                           |
                        =============================================================
                        """),
        /** Шаблон страницы */
        PAGE(
                        """
                        =============================================================
                        |                                                           |
                        |   TOY-AMAZ(o)N.COM                                        |
                        |                                                           |
                        =============================================================
                        |                                                           |
                        |   You are Welcome!                                        |
                        |  %20s                                     |
                        |                                                           |
                        =============================================================
                        |                                                           |
                        |    PRODUCT:                                               |
                        |              %-20s                         |
                        |              %-25s                    |
                        |    AMOUNT:                                                |
                        |              %-20s                         |
                        |    PRICE:                                                 |
                        |              %-20s                         |
                        |    DISCOUNT:                                              |
                        |              %-20s                         |
                        |    SPECIAL:                                               |
                        |              %-20s                         |
                        |                                                           |
                        =============================================================
                        """),
        /** Шаблон итоговой цены в корзине */
        CART_RESULT(
                        """
                        |    --------------------------------------------------     |
                        |    RESULT:                           %10s %-8s  |
                        |                                                           |
                        =============================================================
                        """),
        /** Шаблон заголовка итогов в корзине */
        CART_TITLE_ITEM(
                        """
                        |                         FOR ONE         TOTAL             |
                        |    #   TITLE   AMOUNT   PRICE   SPECIAL PRICE   SPECIAL   |
                        """),
        /** Шаблон строки товара в корзине */
        CART_ITEM(
                        """
                        |    %-4s%-8s%-9s%-8s%-8s%-8s%-8s  |
                        """),
        /** Шаблон строки информации о количестве выбранных товаров */
        CART_AMOUNT(
                        """
                        |                                                           |
                        |    YOU ADDED IN CART:                                     |
                        |             %8s items.                               |
                        |                                                           |
                        =============================================================
                        """);

        private final String template;

        Templates(String template) {
                this.template = template;
        }

        /** Получить шаблон */
        public String getTemplate() {
                return template;
        }
}